Repository: amirlehmam/streamlit
Catalog: locales/*/LC_MESSAGES/*.po
Languages: fr

source: **This WebApp of Astrotool©** is a gift from **[Geometric Thinking](https://geometricthinking.com "Geometric Thinking")** and the developers **Amir & Sachith** to the world. We have learned that there is a **unique way** to *read price charts* for geometric support and resistance. **AND** we have found that there are ways to project, **far in advance, the dates when pivot turns are likely to occur in the market**. We call those dates **ENERGY POINTS (EPs)**. This WebApp will highlight future EPS for you. *It will not tell you which way a market will break*, but **it will give you a upindication when to pay close attention to a chart for price volatility**. * The **MAIN** page is absolutely full of key astrological data related to key dates in BTC history, all neatly summarized in an easy-to-read table. The dates are easily found on the left side of the table and the aspects on the right. The data on the Main page, will give you insight into the types of date we research for this WebApp. For a more thorough and complete understanding, we encourage all users to attend a class, if and when Geometric Thinking holds another class. As of the date of publication, the last date entered was 06/18/22. * The **CHART** page is self-explanatory. The dates with the highest bars are the dates to watch the most. Note that the EP dates should be viewed as +/- 1 day. In other words, an EP may show up a day before or a day after the highlighted date. The founder of Geometric Thinking (GT) has been involved in the market for a very long time and will not be available to teach for more than a few more years. This WebApp is given to help GT students by giving away some of the insights we PRAYED for, when we were starting out. We wish you the very best success in your trading career! **We wish you the very best success in your trading career**.
fr: **Cette WebApp d'Astrotool©** est un cadeau de **[Geometric Thinking](https://geometricthinking.com "Geometric Thinking")** et des développeurs **Amir & Sachith** au monde. Nous avons appris qu'il existe une **manière unique** de *lire les graphiques de prix* pour le support et la résistance géométriques. **Nous avons découvert qu'il existe des moyens de projeter, **longtemps à l'avance, les dates auxquelles des pivots sont susceptibles de se produire sur le marché**. Nous appelons ces dates des **POINTS D'ENERGIE (PE)**. Cette WebApp mettra en évidence les futurs PE pour vous. *Elle ne vous dira pas dans quel sens un marché va se casser*, mais **elle vous donnera une indication du moment où vous devez prêter une attention particulière à un graphique pour la volatilité des prix**. * La page **MAIN** est remplie de données astrologiques clés liées aux dates clés de l'histoire du BTC, toutes soigneusement résumées dans un tableau facile à lire. Les dates sont faciles à trouver sur le côté gauche du tableau et les aspects sur le côté droit. Les données de la page principale vous donneront un aperçu des types de dates que nous recherchons pour cette WebApp. Pour une compréhension plus approfondie et complète, nous encourageons tous les utilisateurs à assister à un cours, si et quand Geometric Thinking organise un autre cours. À la date de publication, la dernière date saisie était le 18/06/22. Le fondateur de Geometric Thinking (GT) est impliqué sur le marché depuis très longtemps et ne sera pas disponible pour enseigner pendant plus de quelques années encore. Cette application Web a pour but d'aider les étudiants de GT en leur donnant certaines des connaissances pour lesquelles nous avons prié, lorsque nous avons commencé. Nous vous souhaitons le meilleur succès dans votre carrière de trader ! **Nous vous souhaitons le meilleur succès dans votre carrière de trader**.

source: Who are we?
fr: Qui sommes-nous ?

source: We opened Geometric Thinking in July 2017 and have now taught literally hundreds of traders worldwide the art of Geometric Thinking. * Geometric Thinking focuses on a unique understanding of how geometry and natural law focuses the minds of traders (en masse) such that **there are points in time and price where we can forecast trend changes are most likely to occur.** * Knowing in advance, for example, that a coin like BTC will likely reach an Energy Point (EP) in time 2 weeks in advance gives the trader almost an “unfair advantage” over other traders. It becomes advantageous for the Geometric Thinker to realize that a projected date 2 weeks in advance is a prime time to observe and plan for, but also analyze the “forecast-able” prices associated with that date. * If you’ve been trading for a while, you already know that this business is cut-throat. It is vicious and even very smart people typically lose everything over time. If you are honest with yourself, you know that **the classic trading techniques, divergences, moving averages, etc. simply do not work consistently.** * Therefore, what does work consistently? What will give you an unfair advantage over other traders? **Geometry and natural law.** * Having this powerful knowledge will not guarantee that you will win, it gives you an cutting-edge advantage. Look at the picture above of the man holding two aces in the hole. Does this guarantee that he will win the hand? **No. There are still 100 ways to lose, even with a pair of aces in the hole**. If he were playing against other professional poker players he would still need to master the game right? He would still need to hide his tells, learn to bluff, learn game mathematics, etc., to be a consistent winner. The same applies to Geometric Thinking and trading. * Now, imagine what Geometric Thinking can do for you. I can give you two Aces on nearly every hand without cheating! **That is a CUTTING-EDGE ADVANTAGE, right?** AstroTool and Geometric Thinking can arrange for you to be dealt two aces in the hole more often than not. If you will combine that with the dedication to master this business, you can become a consistent winner. **We believe this 100%.**
fr: Nous avons ouvert Geometric Thinking en juillet 2017 et avons maintenant enseigné littéralement à des centaines de traders dans le monde entier l'art de la pensée géométrique. * Geometric Thinking se concentre sur une compréhension unique de la façon dont la géométrie et la loi naturelle concentrent l'esprit des traders (en masse) de sorte que **il y a des points dans le temps et le prix où nous pouvons prévoir que les changements de tendance sont les plus susceptibles de se produire.** * Savoir à l'avance, par exemple, qu'une pièce de monnaie comme BTC atteindra probablement un point d'énergie (EP) dans le temps 2 semaines à l'avance donne au trader presque un "avantage injuste" sur les autres traders. Il devient avantageux pour le penseur géométrique de réaliser qu'une date prévue 2 semaines à l'avance est un moment privilégié pour observer et planifier, mais aussi analyser les prix "prévisibles" associés à cette date. * Si vous faites du trading depuis un certain temps, vous savez déjà que ce secteur est un coupe-gorge. Il est vicieux et même les personnes très intelligentes perdent généralement tout au fil du temps. Si vous êtes honnête avec vous-même, vous savez que **les techniques de trading classiques, les divergences, les moyennes mobiles, etc. ne fonctionnent tout simplement pas de manière constante.** * Par conséquent, qu'est-ce qui fonctionne de manière constante ? Qu'est-ce qui vous donnera un avantage injuste sur les autres traders ? **Géométrie et loi naturelle.** * Avoir ces connaissances puissantes ne garantit pas que vous gagnerez, elles vous donnent un avantage de pointe. Regardez l'image ci-dessus de l'homme qui a deux as dans le trou. Cela garantit-il qu'il va gagner la main ? **Non. Il y a toujours 100 façons de perdre, même avec une paire d'as dans le trou**. S'il jouait contre d'autres joueurs de poker professionnels, il devrait quand même maîtriser le jeu, n'est-ce pas ? Il devrait toujours cacher ses tells, apprendre à bluffer, apprendre les mathématiques du jeu, etc. pour être un gagnant régulier. La même chose s'applique à la pensée géométrique et au trading. * Maintenant, imaginez ce que la pensée géométrique peut faire pour vous. Je peux vous donner deux As sur presque toutes les mains sans tricher ! **AstroTool et la Pensée Géométrique peuvent faire en sorte que vous receviez deux as dans le trou le plus souvent possible. Si vous combinez cela avec le dévouement pour maîtriser cette activité, vous pouvez devenir un gagnant constant. **Nous y croyons à 100%.**N

source: Why is this important?
fr: Pourquoi est-ce important ?

source: Whether you care to believe this or not, dates such as the 12/17/2017 (20k top) or the 15/04/2021 (65k) BTC top were seen weeks in advance as a date for a possible top. The 3/12/2020 low was also forecasted as a possible low well more than a month in advance. **WE LITERALLY [TWEETED TO THE WORLD](https://twitter.com/jimfred1276/status/1462641460948267013), THAT THE NOV 2021 TOP WAS IN, A WEEK OR SO AFTER THE FACT, WHEN PRICE WAS STILL ~ 65000!** To the best of our knowledge, we are the only ones who did that. Whether you choose to believe this or not, We assure you it is true that at the very least, **several hundred geometric thinking traders know which dates to watch, and which prices, LONG before other traders do.** **Does that seem important to you? Does that matter? Should you care? We think so.** You can join us in our [Telegram Channel](https://t.me/joinchat/FKSNuqrZpjhlZTJi)
fr: Que vous vous souciez de le croire ou non, des dates telles que le 17/12/2017 (top 20k) ou le 15/04/2021 (65k) BTC ont été vues des semaines à l'avance comme une date pour un possible top. Le bas du 3/12/2020 a également été prévu comme un bas possible bien plus d'un mois à l'avance. **Nous avons littéralement [TWEETÉ AU MONDE] (https://twitter.com/jimfred1276/status/1462641460948267013), QUE LE TOP DE NOV 2021 ÉTAIT EN PLACE, UNE SEMAINE PLUS OU MOINS APRÈS LES FAITS, ALORS QUE LE PRIX ÉTAIT TOUJOURS DE 65000!** À notre connaissance, nous sommes les seuls à l'avoir fait. Que vous choisissiez de le croire ou non, nous vous assurons qu'il est vrai qu'au minimum, **plusieurs centaines de traders à la pensée géométrique savent quelles dates surveiller, et quels prix, bien avant les autres traders.** " "N **Est-ce que cela vous semble important ? Est-ce que cela a de l'importance ? Devriez-vous vous en soucier ? Nous le pensons. **N Vous pouvez nous rejoindre sur notre [Canal Télégramme] (https://t.me/joinchat/FKSNuqrZpjhlZTJi)

source: *About the developers...*
fr: *À propos des développeurs...*

source: This fully implemented Web-App, ready to use in Python, was created as part of a **Memory Paper** for **[DU Data Analytics @ University Pantheon Sorbonne Paris](https://formations.pantheonsorbonne.fr/fr/catalogue-des-formations/diplome-d-universite-DU/diplome-d-universite-KBVXM363/diplome-d-universite-sorbonne-data-analytics-KPMK3V7Z.html)**. The two developers and students are **[Amir Lehmam](https://fr.linkedin.com/in/amirlehmam)** & **[Sachith Galbokka](https://fr.linkedin.com/in/sachith-galbokka-b22187204)**. Both being passionate about blockchain and programming since they met each others in 2016', they linked their passion with their interest to create this web-app. This was made possible only by our mentor **[Jim Fredrickson](https://geometricthinking.com/about-us/)** - *creator of GeometricThinking.com & AstroTool©* - who allowed us to translate "Astrotool©" into Python from his excel sheet which he has been working on since 1991'... We also want to thanks **[Marc Arthure DIAYE](http://marc-arthur.diaye.monsite-orange.fr/)** - *director of the DU Data Analytics at Pantheon Sorbonne* - for allowing us AstroTool© as a memory paper subject! The developers take no credit for the basic calculations and methods of the "Astrotool©" algorithm --- It is a complete property of our mentor Jim Fredrickson --- Our job was to translate the entire "Astrotool" algorithm into Python in order to make it competitive and up to date. The creation of the Web-App is a major asset for the ease of use of such an algorithm, it was a necessary step for the progress of such a project! A lot of work has been done (about 3 months of intense coding during the summer of 2022...), but the biggest part is still to come! The AstroTool Team has many upcoming ingenious ideas and we will bring astrotool to a level never seen before! Enjoy the Alpha...
fr: Cette Web-App entièrement implémentée, prête à l'emploi en Python, a été créée dans le cadre d'un **Memory Paper** pour le **[DU Data Analytics @ University Pantheon Sorbonne Paris](https://formations.pantheonsorbonne.fr/fr/catalogue-des-formations/diplome-d-universite-DU/diplome-d-universite-KBVXM363/diplome-d-universite-sorbonne-data-analytics-KPMK3V7Z.html)**. Les deux développeurs et étudiants sont **[Amir Lehmam](https://fr.linkedin.com/in/amirlehmam)** & **[Sachith Galbokka](https://fr.linkedin.com/in/sachith-galbokka-b22187204)**. Tous deux étant passionnés par la blockchain et la programmation depuis leur rencontre en 2016', ils ont lié leur passion à leur intérêt pour créer cette web-app. Ceci n'a été rendu possible que par notre mentor **[Jim Fredrickson](https://geometricthinking.com/about-us/)** - *créateur de GeometricThinking.com & AstroTool©* - qui nous a permis de traduire "Astrotool©" en Python à partir de sa feuille excel sur laquelle il travaille depuis 1991'... Nous tenons également à remercier **[Marc Arthure DIAYE](http://marc-arthur.diaye.monsite-orange.fr/)** - *directeur du DU Data Analytics à Panthéon Sorbonne* - pour nous avoir permis d'utiliser AstroTool© comme sujet de mémoire! Les développeurs ne s'attribuent aucun mérite pour les calculs et méthodes de base de l'algorithme "Astrotool©" --- C'est une propriété complète de notre mentor Jim Fredrickson --- Notre travail a été de traduire l'intégralité de l'algorithme "Astrotool©" en Python afin de le rendre compétitif et à jour. La création de la Web-App est un atout majeur pour la facilité d'utilisation d'un tel algorithme, c'était une étape nécessaire pour l'avancement d'un tel projet ! Beaucoup de travail a été fait (environ 3 mois de codage intense pendant l'été 2022...), mais le plus gros reste à faire ! L'équipe AstroTool a beaucoup d'idées ingénieuses à venir et nous allons amener astrotool à un niveau jamais vu auparavant ! Profitez de l'Alpha...

source: **AstroTool© Help Page**
fr: **Aide AstroTool©**

source: GeometricThinking is of the opinion that it is FAR better to be **focus on time** as a factor in trading, than to first focus on price. However, forecasting time is much trickier than forecasting price. There are literally **hundreds of hidden variables** that we were never even taught to consider.
fr: L'équipe GeometricThinking est d'avis qu'il est BEAUCOUP mieux de se **focaliser sur le temps** comme facteur dans le trading, que de se concentrer d'abord sur le prix. Cependant, prévoir le temps est beaucoup plus délicat que de prévoir le prix. Il y a littéralement des **centaines de variables cachées** que l'on ne nous a jamais appris à considérer.

source: AstroTool© was developed to solve a significant problem for forecasters who are employing natural law (astrology, arithmetic, geometry and universal principles of growth). There are so many factors to consider that it quickly becomes impossible for a serious forecaster to keep a handle on the hundreds of variables that are at work. We found ourselves missing market turns that we had ourselves forecasted in the past, because we got lost in the minutiae of forecasting, along with simply losing track of where we were in real-time. AstroTool has solved this problem.
fr: AstroTool© a été développé pour résoudre un problème important pour les prévisionnistes qui utilisent la loi naturelle (astrologie, arithmétique, géométrie et principes universels de croissance). Il y a tellement de facteurs à prendre en compte qu'il devient rapidement impossible pour un prévisionniste sérieux de garder le contrôle sur les centaines de variables en jeu. Nous nous sommes retrouvés à rater des tournants du marché que nous avions nous-mêmes prévus dans le passé, parce que nous nous sommes perdus dans les méandres de la prévision et que nous avons tout simplement perdu la trace de notre position en temps réel. AstroTool a résolu ce problème.

source: Following up on the success of AstroTool© v5.3 (*which was made available on this website to the public for free*), v6.0 has been completed. It offers several improvements over v5.3 and is now the tool of choice for those who have access to it.
fr: Suite au succès de l'AstroTool© v5.3 (*qui a été mis gratuitement à la disposition du public sur ce site web*), la v6.0 est terminée. Elle offre plusieurs améliorations par rapport à la v5.3 et constitue désormais l'outil de choix pour ceux qui y ont accès.

source: Our intention is to make v6.0 available to the public for a short window of time, as we move toward putting the key charts and output on our website. **AstroTool’s output will be put behind a paywall at some point in the future**. Those who have taken the time to research the accuracy of Astrotool v5.3 as a forecasting tool have found it to be on the order of **80% accurate in forecasting market turns**. These forecasts are often made months in advance. We invite others to do their own research to see if this statement is self-serving bluster, or is in fact the Truth. **We are confident in what you will find.**
fr: Nous avons l'intention de mettre la v6.0 à la disposition du public pendant une courte période, alors que nous nous apprêtons à mettre les principaux graphiques et résultats sur notre site Web. **Les résultats d'AstroTools seront mis derrière un paywall à un moment donné dans le futur**. Ceux qui ont pris le temps d'étudier la précision d'Astrotool v5.3 en tant qu'outil de prévision ont constaté qu'il était de l'ordre de **80% de précision dans la prévision des retournements de marché**. Ces prévisions sont souvent faites des mois à l'avance. Nous invitons les autres à faire leurs propres recherches pour voir si cette déclaration est une fanfaronnade intéressée ou si elle est en fait la vérité. **Nous sommes confiants dans ce que vous trouverez.

source: The key component of AstroTool is the chart of forecasted **Energy Points (eps)**. These are the days that have a higher-than-average likelihood of being dates of market turns. In some cases, those dates present themselves as eps immediately, with sharp turns (long green or red candles) on or about the day in question. But in many cases there is an extended period of time that elapses before it becomes clear that a major pivot has been formed. Here are two such examples:
fr: L'élément clé d'AstroTool est le graphique des **Points d'énergie (eps)** prévus. Ce sont les jours qui ont une probabilité supérieure à la moyenne d'être des dates de retournement du marché. Dans certains cas, ces dates se présentent sous forme d'eps immédiatement, avec des virages brusques (longues bougies vertes ou rouges) le jour même ou autour du jour en question. Mais dans de nombreux cas, il s'écoule une longue période de temps avant qu'il ne devienne évident qu'un pivot majeur s'est formé. Voici deux exemples de ce type :

source: Chart
fr: Graphique

source: As mentioned above, the key component of Astrotool is the chart of forecasted EP dates in the months ahead. We use it with the understanding that it is accurate **+/- 1 day**. In other words, if a date like 4/10/2021 is forecasted, then we know to be alert from 4/9-4/11/2021. Here is an example of the chart:
fr: Comme nous l'avons mentionné plus haut, l'élément clé d'Astrotool est le tableau des dates prévues pour les PE dans les mois à venir. Nous l'utilisons en sachant qu'il est précis **+/- 1 jour**. En d'autres termes, si une date comme le 4/10/2021 est prévue, nous savons qu'il faut être vigilant du 4/9 au 4/11/2021. Voici un exemple de graphique :

source: As you can see, 10/3/2022 is being highlighted as a date to watch. There are many other visual aids as well. For example, here is a chart that shows the placement of each of the planets longitude, updated daily, superimposed upon the Gann Square of Nine chart (Sq9). **It was this visual that alerted us in advance to the likelihood of the 4/14/2021 high being a significant EP and turned out to be the 65k BTC Top we all aware of.**
fr: Comme vous pouvez le voir, le 10/3/2022 est mis en évidence comme une date à surveiller. Il existe également de nombreuses autres aides visuelles. Par exemple, voici un graphique qui montre le placement de la longitude de chacune des planètes, mis à jour quotidiennement, superposé au graphique du Carré de Neuf de Gann (Sq9). **C'est ce visuel qui nous a alerté à l'avance sur la probabilité que le sommet du 14/4/2021 soit un PE significatif et s'est avéré être le sommet de 65k BTC que nous connaissons tous.**

source: Below here's a plot of the **4/14/2021** Sq9 visualization.. We can clearly see **6 planets** ([Jup_G], [Ear_H], [Mer_G], [Ura_H], [Mer_H], [Mar_H]) that are in this 'yellow' area. This yellow zone is separated into 8 lines, all 45 degrees apart. **The more planets in this zone, the more important the date in question will be perceived as a pivot!**
fr: Ci-dessous, voici un tracé de la visualisation du **4/14/2021** Sq9.. Nous pouvons clairement voir **6 planètes** ([Jup_G], [Ear_H], [Mer_G], [Ura_H], [Mer_H], [Mar_H]) qui sont dans cette zone 'jaune'. Cette zone jaune est séparée en 8 lignes, toutes distantes de 45 degrés. **Plus il y a de planètes dans cette zone, plus la date en question sera perçue comme un pivot!**

source: If you study the data on the Main page, you will gain insight into the things we search. At first sight it might looks difficult to understand, but it's not! **Let's unpack it!**
fr: Si vous étudiez les données de la page principale, vous aurez un aperçu de ce que nous recherchons. À première vue, cela peut sembler difficile à comprendre, mais ça ne l'est pas ! **Déballons-le!**

source: The first two rows correspond to the actual transit of the planets. Their current degrees are displayed in the first row. In the second row the name of the current house of the planet is given as well as its number of degrees in this house. This data is updated automatically every day by our algorithm.
fr: Les deux premières rangées correspondent au transit réel des planètes. Leurs degrés actuels sont affichés dans la première ligne. Dans la deuxième ligne, le nom de la maison actuelle de la planète est donné ainsi que son nombre de degrés dans cette maison. Ces données sont mises à jour automatiquement chaque jour par notre algorithme.

source: The third and fourth rows correspond to the cumulative degrees since the date indicated. The third row contains the cumulative number of degrees, and the fourth row contains the number of revolutions followed by the number of degrees remaining before the next revolution.
fr: Les troisième et quatrième rangées correspondent aux degrés cumulés depuis la date indiquée. La troisième ligne contient le nombre de degrés cumulés, et la quatrième ligne contient le nombre de révolutions suivi du nombre de degrés restant avant la prochaine révolution.
