Repository: amirlehmam/streamlit
Catalog: locales/*/LC_MESSAGES/*.po
Languages: fr

source: Apart from the first 2 rows, the rest of the rows are based on the cumulative degrees since the major key date or pivot date... You can find the date and the related data information of '31/10/2008' which is the BTC White Paper or '01/03/2009', the genesis-block day also major TOPS such as '17/12/2017' (20k) or '11/10/2021' (69k) are also in the table...
fr: A part les 2 premières lignes, le reste des lignes sont basées sur les degrés cumulés depuis la date clé majeure ou date pivot... Vous pouvez trouver la date et les informations relatives aux données du '31/10/2008', qui est le livre blanc de la CTB, ou du '01/03/2009', le jour du bloc de genèse. Les TOPS majeurs tels que '17/12/2017' (20k) ou '11/10/2021' (69k) sont également dans le tableau...

source: **The purpose of this 'Main' table was to have a record & calculation of all our important dates and key information in relation to our solar system planets.** It is very useful for advanced users in astro-trading! It is a must-have!
fr: **Le but de cette table 'principale' était d'avoir un enregistrement et un calcul de toutes les dates importantes et des informations clés en relation avec les planètes de notre système solaire. ** Elle est très utile pour les utilisateurs avancés en astro-trading ! C'est un must-have !

source: **AstroTool© User Guide**
fr: Guide de l'utilisateur d'AstroTool©

source: **Main**
fr: Principal

source: This section shows the current helio longitude of each planet on the 2nd line, which gives “Today date” on the far left. It is followed by “mod 30”. This line shows the current number of degrees into the current house. In the example above, the earth has moved into Aries…
fr: Cette section montre la longitude hélio actuelle de chaque planète sur la 2ème ligne, ce qui donne "Today date" à l'extrême gauche. Elle est suivie de "mod 30". Cette ligne indique le nombre actuel de degrés dans la maison actuelle. Dans l'exemple ci-dessus, la terre est entrée dans la constellation du Bélier...

source: Each of the following lines beginning with “White Paper date”, shows how far each planet has moved since a key date in BTC history. Since the White Paper was published on 10/31/2008, the earth has moved 5000 degrees.
fr: Chacune des lignes suivantes, commençant par "date du livre blanc", indique la distance parcourue par chaque planète depuis une date clé de l'histoire de la CTB. Depuis la publication du livre blanc le 31/10/2008, la terre s'est déplacée de 5000 degrés.

source: The line following (mod360) shows us that the earth has moved 13 full cycles (13 earth years), and is 322 degrees into the 14th cycle, since WP date.
fr: La ligne suivante (mod360) nous montre que la terre s'est déplacée de 13 cycles complets (13 années terrestres), et est à 322 degrés dans le 14ème cycle, depuis la date WP.

source: Note that the Nep column has a highlighted ‘30’ on the Genesis block date. 30 degrees is a key degree so it is highlighted to stand out (of course Neptune moves very slowly, and may remain at 30 degrees for a month, so it is only useful when in tandem with other more immediate signals).
fr: Notez que la colonne Nep a un '30' surligné sur la date du bloc de Genèse. 30 degrés est un degré clé, il est donc mis en évidence pour se démarquer (bien sûr, Neptune se déplace très lentement, et peut rester à 30 degrés pendant un mois, il n'est donc utile qu'en tandem avec d'autres signaux plus immédiats).

source: **Chart**
fr: **Graphique**

source: This is perhaps the most important visual in AstroTool. It shows at a glance the dates ahead in which there is a forecast of a likely change in trend. It is calculated by the aggregation of a large number of classical and esoteric timing signals employed by traders worldwide.
fr: C'est peut-être le visuel le plus important d'AstroTool. Il montre d'un coup d'œil les dates à venir pour lesquelles on prévoit un changement probable de tendance. Il est calculé par l'agrégation d'un grand nombre de signaux de timing classiques et ésotériques utilisés par les traders du monde entier.

source: **Longitudes on Square of 9**
fr: **Longitudes sur Carré de 9**

source: This visual shows the Helio longitude of each of the planets in red, and the Geo longitude in blue. The longitudes are overlaid on Gann’s Square of 9 chart.
fr: Ce visuel montre la longitude Hélio de chacune des planètes en rouge, et la longitude Géo en bleu. Les longitudes sont superposées sur le graphique du carré de 9 de Gann.

source: It has been our experience that on days when most planets, either in Helio or Geo, are on one of the 45 degrees lines, “the cross” (shown in yellow), a change in trend is likely. This tool alerted us to the 4/14/2021 high being a major pivot, in advance.
fr: D'après notre expérience, les jours où la plupart des planètes, soit en Hélio, soit en Géo, se trouvent sur l'une des lignes de 45 degrés, "la croix" (représentée en jaune), un changement de tendance est probable. Cet outil nous a alerté à l'avance que le sommet du 14/4/2021 était un pivot majeur.

source: **Transit Aspects**
fr: **Aspects Transit**

source: **Natal Aspects**
fr: **Aspects Natal**

source: Here we see today’s planetary aspects. The key degrees to look for are highlighted in yellow. For example, in the example above, Earth & Mercury are in conjunction, and Pluto and Mercury are 60 degrees apart.
fr: Nous voyons ici les aspects planétaires d'aujourd'hui. Les degrés clés à rechercher sont soulignés en jaune. Par exemple, dans l'exemple ci-dessus, la Terre et Mercure sont en conjonction, et Pluton et Mercure sont séparés de 60 degrés.

source: The blue are is for those rare times when today’s planets are making an important aspect with BTC’s natal chart. For example, if today’s Saturn longitude was 60 degrees with where Jupiter was on the White Paper date, it would show up here.
fr: La zone bleue est réservée aux rares fois où les planètes du jour forment un aspect important avec le thème natal de la CTB. Par exemple, si la longitude de Saturne d'aujourd'hui était de 60 degrés par rapport à l'emplacement de Jupiter à la date du livre blanc, cela apparaîtrait ici.

source: **Retrograde activity**
fr: **Activité rétrograde**

source: This visual shows us the planet’s retrograde status over the next 10 days. Here we can see that 6 of the 8 planets are retrograde today.
fr: Ce visuel nous montre le statut rétrograde des planètes au cours des 10 prochains jours. Ici, nous pouvons voir que 6 des 8 planètes sont rétrogrades aujourd'hui.

source: Importantly, we can see that Mercury will be no longer retrograde (will go direct) on 10/2/2022. You may see an “X” in one of the squares (occasionally not shown here). That would indicate that the planet had returned to its prior longitude from which it’s last retrograde has begun.
fr: Il est important de noter que Mercure ne sera plus rétrograde (sera direct) le 10/2/2022. Vous pouvez voir un "X" dans l'un des carrés (occasionnellement non montré ici). Cela indiquerait que la planète est retournée à sa longitude antérieure à partir de laquelle sa dernière rétrogradation a commencé.

source: **Progression from all Pivots**
fr: **Progression de tous les Pivots**

source: This last section is rather like the very first section. It notes how many degrees each planet has moved since a key pivot date. Important degrees are highlighted in yellow for quick reference. Note that is TOTAL degrees moved, which can get to be pretty big number for fast-moving planets like Mercury. You will note that sometimes an odd-looking number like ‘1890’ will be highlighted. In such a case, the number is 90, 180 or 270 degrees from a full planetary cycle. It is not necessary to do the calculation. Astrotool has already done the calculation and highlighted the cell for you.
fr: Cette dernière section est un peu comme la toute première section. Elle note combien de degrés chaque planète s'est déplacée depuis une date pivot clé. Les degrés importants sont surlignés en jaune pour une référence rapide. Notez qu'il s'agit de degrés TOTAL déplacés, ce qui peut devenir un nombre assez important pour les planètes qui se déplacent rapidement comme Mercure. Vous remarquerez que parfois un nombre étrange comme '1890' sera mis en évidence. Dans ce cas, le nombre correspond à 90, 180 ou 270 degrés d'un cycle planétaire complet. Il n'est pas nécessaire de faire le calcul. Astrotool a déjà fait le calcul et mis en évidence la cellule pour vous.

source: ***We wish you the best in your trading career and believe that this tool will be of tremendous help, once you learn how to use it on a daily basis. Happy trading!***
fr: ***Nous vous souhaitons le meilleur dans votre carrière de trader et nous sommes convaincus que cet outil vous sera d'une aide précieuse, une fois que vous aurez appris à l'utiliser au quotidien. Bon trading!***

source: Here is an aerial view of the **Khufru pyramid in Egypt**, some claim that the ancient builders bequeathed these pyramids to us as an *astro-calculator*, which **W.D Gann** calls the ***Square of 9***. It has been discovered that each **45°** row of this pyramid (**8 sides**) has a **small inclination**, was this intentional to reveal the importance of the **45° degree**? Or as they call it, an architectural coincidence...
fr: Voici une vue aérienne de la pyramide **Khufru en Egypte**, certains prétendent que les anciens bâtisseurs nous ont légué ces pyramides comme un *calculateur astronomique*, que **W.D Gann** appelle le ***carré de 9***. Il a été découvert que chaque rangée **45°** de cette pyramide (**8 côtés**) a une **petite inclinaison**, était-ce intentionnel pour révéler l'importance du **45° degré** ? Ou comme on l'appelle, une coïncidence architecturale...

source: **Energy Points Chart (next 3 months)**
fr: **Tableau des points d'énergie (3 prochains mois)**

source: **Energy Points Hits on BTC @ last 2 years**
fr: **Points d'énergie atteints sur BTC @ 2 dernières années**

source: Total Major EP since last 2 years
fr: Total des EP majeurs depuis les 2 dernières années

source: **Twitter Sentiment Analysis on $BTC**
fr: **Analyse du sentiment de Twitter sur le $BTC**

source: Cryptocurrencies are rising in importance as an investment option and alternative currency. Thus, investors are keen on finding timely market movement insights. One of such sources is Twitter due to its live feed of information on cryptocurrencies and emotional information from investors expressing their sentiments.
fr: Les crypto-monnaies gagnent en importance en tant qu'option d'investissement et monnaie alternative. Ainsi, les investisseurs sont désireux de trouver des informations opportunes sur les mouvements du marché. L'une de ces sources est Twitter, en raison de son flux d'informations en direct sur les crypto-monnaies et des informations émotionnelles des investisseurs exprimant leurs sentiments.

source: This page will examine the extent to which Twitter sentiments can be used to correlate human mass-psychology and our major EP days date… This study was conducted using a snscrape for Twitter scrapping, a “pipeline_nlp” in order to clean our samples, and a lexicon-based approach through the VADER algorithm for sentiment analysis.
fr: Cette page examinera dans quelle mesure les sentiments sur Twitter peuvent être utilisés pour établir une corrélation entre la psychologie de masse humaine et nos principaux jours d'EP... Cette étude a été menée à l'aide d'un snscrape pour le scrapping de Twitter, d'un "pipeline_nlp" afin de nettoyer nos échantillons, et d'une approche basée sur le lexique via l'algorithme VADER pour l'analyse des sentiments.

source: This study has been made on 13 different MAJOR EP dates, we took for each of them, -1/+1 days from the given date (eg: our major EP is at 15/09/2022, we scrapped from Twitter 83k tweets from these 3 consecutive dates: 14/09 | 15/09 | 16/09). The total scrapped sample represent more than 850k tweets for those 13 major EP.
fr: Cette étude a été faite sur 13 dates différentes d'EP majeur, nous avons pris pour chacune d'entre elles, -1/+1 jours à partir de la date donnée (ex : notre EP majeur est au 15/09/2022, nous avons récupéré de Twitter 83k tweets de ces 3 dates consécutives : 14/09 | 15/09 | 16/09). Le total de l'échantillon supprimé représente plus de 850k tweets pour ces 13 EP majeurs.
